Octopus/InformationRegisters/ФотоДляВыгрузки.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.11">
	<InformationRegister>
		<Properties>
			<Name>ФотоДляВыгрузки</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Фото</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаСоздания</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Док</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.vrgРеализацияМобильная</v8:Type>
						<v8:Type>cfg:DocumentRef.vrgИнвентаризацияМобильная</v8:Type>
						<v8:Type>cfg:DocumentRef.vrgЗаказКлиентаМобильный</v8:Type>
						<v8:Type>cfg:DocumentRef.vrgВозвратМобильный</v8:Type>
						<v8:Type>cfg:DocumentRef.vrgТребованияНакладнаяМобыльный</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Ссылка</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.vrgИнвентаризацияМобильная</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>УИД</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>НомерФото</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Octopus/CommonForms/ПросмотрФотоДок/Ext/Form/Module.bsl
// + 48503 ДДГ 4-12 ноя 2021
// обнов 48805 ДДГ 24 ноя 2021
// обнов 48929 ДДГ 5-6 дек 2021
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

	

	//ТипОперацииОтправкиФото = Параметры.ТипОперацииОтправкиФото;

	//Если НЕ ЗначениеЗаполнено(ТипОперацииОтправкиФото) Тогда
	//	Отказ = Истина;
	//	Возврат;
	//КонецЕсли;
	Наименование =      ?(Параметры.Свойство("Наименование"),			Параметры.Наименование,			"");
	НомерДетали			= ?(Параметры.Свойство("УИД"),			Параметры.УИД,			NULL);
	типДок			= ?(Параметры.Свойство("типДок"),			Параметры.типДок,			NULL);

	
	//Если Параметры.Свойство("Склады") Тогда
	//	Для Каждого СтрокиСклада из Параметры.Склады Цикл
	//		НовСтрока = Склады.Добавить();
	//		НовСтрока.Склад = СтрокиСклада.Склад;
	//		НовСтрока.РядИПолка = СтрокиСклада.РядИПолка;
	//	КонецЦикла;
	//КонецЕсли;
	//НомерКомплекта		= ?(Параметры.Свойство("НомерКомплекта"),		Параметры.НомерКомплекта,		0);
	//Автор				= ?(Параметры.Свойство("Автор"),				Параметры.Автор,				"");
	//ДатаРезервирования	= ?(Параметры.Свойство("ДатаРезервирования"),	Параметры.ДатаРезервирования,	Дата(1,1,1));

	//НадписьАвторДата			= Автор + " " + ДатаРезервирования;

	АдресаФото.Параметры.УстановитьЗначениеПараметра("НомерДетали",			НомерДетали);
	АдресаФото.Параметры.УстановитьЗначениеПараметра("ПолучатьХранилище",	ЛОЖЬ);

	КолВоФото = ПолучитьКолВоФотоДетали(НомерДетали);

	ВывестиКартинкиНаФорму();

	Если ФотоДляОтображения.Количество() Тогда
		НомерФото = ФотоДляОтображения[0].НомерФото;
	КонецЕсли;

КонецПроцедуры

&НаСервере
Процедура ВывестиКартинкиНаФорму()

	Запрос = Новый Запрос(АдресаФото.ТекстЗапроса);

	ПараметрыЗапроса = АдресаФото.Параметры.Элементы;

	Для Каждого ПараметрЗапроса Из ПараметрыЗапроса Цикл
		Запрос.Параметры.Вставить(Строка(ПараметрЗапроса.Параметр), ПараметрЗапроса.Значение);
	КонецЦикла;

	Запрос.Параметры.Вставить("ПолучатьХранилище", ИСТИНА);

	Результат = Запрос.Выполнить();

	ТаблицаРезультата = Результат.Выгрузить();

	ВсегоСтрок		= ТаблицаРезультата.Количество();
	ПоследнийИндекс	= ВсегоСтрок - 1;

	Для ИДХ=0 По ПоследнийИндекс Цикл
		СтрокаТР = ТаблицаРезультата[ИДХ];
		ВывестиКартинкуНаФорму(СтрокаТР, ИДХ);
	КонецЦикла;

КонецПроцедуры

&НаСервере
Процедура ВывестиКартинкуНаФорму(СтрокаТР, ИДХ)

	Порядок  = ИДХ + 1;

	ИмяСтраницы = "СтраницаКартинок"	+ Порядок;
	ИмяЭлемента = "ПолеКартинки"		+ Порядок;

	ДобавитьСтрокуФото(СтрокаТР, ИмяСтраницы, ИмяЭлемента);

	СтраницаКартинки	= ПолучитьСтраницуКартинки(ИмяСтраницы);
	ПолеКартинки		= ПолучитьПолеКартинки(СтраницаКартинки, ИмяЭлемента, ИДХ);

КонецПроцедуры

&НаСервере
Процедура ДобавитьСтрокуФото(СтрокаТР, ИмяСтраницы, ИмяЭлемента)

			ДанныеКартинки = СтрокаТР.ХранилищеФото.Получить();
		АдресХранилища = ПоместитьВоВременноеХранилище(ДанныеКартинки, УникальныйИдентификатор);
	
	НоваяСтрока = ФотоДляОтображения.Добавить();
	НоваяСтрока.НомерФото			= СтрокаТР.НомерФото;
	НоваяСтрока.АдресХранилища		= АдресХранилища;
	НоваяСтрока.ИмяПоляКартинки		= ИмяЭлемента;
	НоваяСтрока.ИмяСтраницыКартинки	= ИмяСтраницы;

КонецПроцедуры

&НаСервере
Функция ПолучитьСтраницуКартинки(ИмяСтраницы)

	ИмяЭлемента		= ИмяСтраницы;
	ТипЭлемента		= Тип("ГруппаФормы");

	НоваяГруппа		= Элементы.Найти(ИмяЭлемента);

	Если НоваяГруппа = Неопределено Тогда
		НоваяГруппа = Элементы.Добавить(ИмяЭлемента, ТипЭлемента, Элементы.СтраницыКартинок);
	КонецЕсли;

	НоваяГруппа.Видимость	= Истина;
	НоваяГруппа.Вид			= ВидГруппыФормы.Страница;
	//НоваяГруппа.Заголовок	= ЗаголовокСтраницы;

	Возврат НоваяГруппа;

КонецФункции

&НаСервере
Функция ПолучитьПолеКартинки(ГруппаРодитель, ИмяЭлемента, ИДХ)

	РеференсКартинки	= Элементы.Фото;
	ТипЭлемента			= Тип("ПолеФормы");

	НовыйЭлемент = Элементы.Найти(ИмяЭлемента);

	Если НовыйЭлемент = Неопределено Тогда
		НовыйЭлемент = Элементы.Добавить(ИмяЭлемента, ТипЭлемента, ГруппаРодитель);
	КонецЕсли;

	ЗаполнитьНастройкиЭлементаПоРеференсу(НовыйЭлемент, РеференсКартинки);

	НовыйЭлемент.ПоложениеЗаголовка	= РеференсКартинки.ПоложениеЗаголовка;

	Если НЕ ЗначениеЗаполнено(НовыйЭлемент.ПутьКДанным) Тогда
		НовыйЭлемент.ПутьКДанным = "ФотоДляОтображения[" + ИДХ + "].АдресХранилища";
	КонецЕсли;

	Возврат НовыйЭлемент;

КонецФункции

&НаСервере
Процедура ЗаполнитьНастройкиГруппыПоРеференсу(Группа, Референс)
	Группа.Вид									= Референс.Вид;
	Группа.Группировка							= Референс.Группировка;
	Группа.ОтображатьЗаголовок					= Референс.ОтображатьЗаголовок;
	Группа.Отображение							= Референс.Отображение;
	Группа.ГоризонтальноеПоложениеПодчиненных	= Референс.ГоризонтальноеПоложениеПодчиненных;
	Группа.ШиринаПодчиненныхЭлементов			= Референс.ШиринаПодчиненныхЭлементов;
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьНастройкиЭлементаПоРеференсу(Элемент, Референс)
	Элемент.Вид							= Референс.Вид;
	Элемент.Высота						= Референс.Высота;
	Элемент.Ширина						= Референс.Ширина;
	Элемент.РастягиватьПоВертикали		= Референс.РастягиватьПоВертикали;
	Элемент.РастягиватьПоГоризонтали	= Референс.РастягиватьПоГоризонтали;
	Элемент.АвтоМаксимальнаяВысота		= Референс.АвтоМаксимальнаяВысота;
	Элемент.АвтоМаксимальнаяШирина		= Референс.АвтоМаксимальнаяШирина;
	Элемент.МаксимальнаяВысота			= Референс.МаксимальнаяВысота;
	Элемент.МаксимальнаяШирина			= Референс.МаксимальнаяШирина;
	Элемент.ВертикальноеПоложение		= Референс.ВертикальноеПоложение;
	Элемент.ГоризонтальноеПоложение		= Референс.ГоризонтальноеПоложение;
КонецПроцедуры

////////////////////////////////

&НаСервереБезКонтекста
Функция ПолучитьКолВоФотоДетали(НомерДетали)

	НаборФото = РегистрыСведений.ФотоДляВыгрузки.СоздатьНаборЗаписей();

	НаборФото.Отбор.УИД.Установить(НомерДетали);

	НаборФото.Прочитать();

	КолВоФото = НаборФото.Количество();

	Возврат КолВоФото;

КонецФункции

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	//Заголовок = ПолучитьЗаголовокФормы(НомерДетали, КолВоФото);
	ОбновитьНадписьКолВоФотоНомерДетали();
КонецПроцедуры

&НаКлиенте
Функция ПолучитьЗаголовокФормы(Наименование, КолВоФото)

	Если ЗначениеЗаполнено(Наименование) Тогда
		Заголовок = Строка(КолВоФото) + " фото" +Наименование;
	Иначе
		Заголовок = "Фото деталей";
	КонецЕсли;

	Возврат Заголовок;

КонецФункции

&НаКлиенте
Процедура ОбновитьНадписьКолВоФотоНомерДетали()

	Если ЗначениеЗаполнено(Наименование) Тогда
		НадписьКолВоФотоНомерДетали = Строка(КолВоФото) + " фото " + Наименование;
	Иначе
		НадписьКолВоФотоНомерДетали = Строка(КолВоФото) + " фото";
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ОбновитьФорму()

	Элементы.АдресаФото.Обновить();

	//Заголовок = ПолучитьЗаголовокФормы(НомерДетали, КолВоФото);

	ОбновитьНадписьКолВоФотоНомерДетали();

КонецПроцедуры

////////////////////////////////

&НаКлиенте
Процедура ДобавитьФото(Команда)

	НомерФото = СнятьФото();
	ОбновитьФорму();
	УстановитьСтрокуФотоТекущей(НомерФото);

КонецПроцедуры

&НаКлиенте
Функция СнятьФото()

	//Если НомерДетали <= 0 Тогда
	//	Сообщить("Нельзя добавить фото без привязки к номеру б/у.");
	//	Возврат -1;
	//КонецЕсли;

	ДанныеФото = КлиентОбщий.ПолучитьДанныеФотоСнимка();

	Если ДанныеФото = Неопределено Тогда 
		Возврат -1;
	КонецЕсли;

	ТекущееФото		= ДанныеФото.ПолучитьДвоичныеДанные();
	АдресФото		= ПоместитьВоВременноеХранилище(ТекущееФото, УникальныйИдентификатор);

	СтруктураЗаписи	= ДобавитьФотоВРегистр(НомерДетали, АдресФото,,типДок);
	КолВоФото		= ПолучитьКолВоФотоДетали(НомерДетали);
	ИДХ				= КолВоФото - 1;

	ВывестиКартинкуНаФорму(СтруктураЗаписи, ИДХ);

	НомерФото = СнятьФото();

	НомерФото = ?(НомерФото < 0, СтруктураЗаписи.НомерФото, НомерФото);

	Возврат НомерФото;

КонецФункции

&НаСервереБезКонтекста
Функция ДобавитьФотоВРегистр(НомерДетали, АдресФото, ЭтоАдресНаСайте = Ложь,типДок = Неопределено)

	//Пользователь1С	= ПолучениеНастроек.ПолучитьПользователя1С();
	НомерФото		= ПолучитьПоследнийНомерФото(НомерДетали);
	ХранилищеФото	= Неопределено;

	МенеджерЗаписи = РегистрыСведений.ФотоДляВыгрузки.СоздатьМенеджерЗаписи();
	МенеджерЗаписи.УИД				        = НомерДетали;
	МенеджерЗаписи.НомерФото				= НомерФото;
	МенеджерЗаписи.Док                      = типДок;

	
		ДанныеФото		= ПолучитьИзВременногоХранилища(АдресФото);
		ХранилищеФото	= Новый ХранилищеЗначения(ДанныеФото);

		МенеджерЗаписи.Фото			= ХранилищеФото;

	

	//МенеджерЗаписи.Автор					= Пользователь1С;
	МенеджерЗаписи.ДатаСоздания				= ТекущаяДата();
	МенеджерЗаписи.Записать();

	СтруктураЗаписи = Новый Структура;
	СтруктураЗаписи.Вставить("НомерФото",		НомерФото);
	//СтруктураЗаписи.Вставить("ЭтоАдресНаСайте", ЭтоАдресНаСайте);
	//СтруктураЗаписи.Вставить("АдресФото",		АдресФото);
	СтруктураЗаписи.Вставить("ХранилищеФото",	ХранилищеФото);

	Возврат СтруктураЗаписи;

КонецФункции

&НаСервереБезКонтекста
Функция ПолучитьПоследнийНомерФото(НомерДетали)

	ПоследнийНомер = 0;

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ISNULL(МАКСИМУМ(ФотоДляВыгрузки.НомерФото), 0)
		|		КАК ПоследнийНомер
		|ИЗ
		|	РегистрСведений.ФотоДляВыгрузки
		|		КАК ФотоДляВыгрузки
		|ГДЕ
		|	ФотоДляВыгрузки.УИД = &НомерДетали
		|";

	Запрос.УстановитьПараметр("НомерДетали", НомерДетали);

	РезультатЗапроса = Запрос.Выполнить();

	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Если ВыборкаДетальныеЗаписи.Следующий() Тогда
		ПоследнийНомер = ВыборкаДетальныеЗаписи.ПоследнийНомер;
	КонецЕсли;

	ПоследнийНомер = ПоследнийНомер + 1;

	Возврат ПоследнийНомер;

КонецФункции

/////////////////////////////////

&НаКлиенте
Процедура АдресаФотоВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
КонецПроцедуры

&НаКлиенте
Процедура АдресаФотоПриАктивизацииСтроки(Элемент)

	ТекДанные = Элементы.АдресаФото.ТекущиеДанные;

	Если ТекДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;

	НомерФото = ТекДанные.НомерФото;

	НайденнаяСтрока = НайтиСтрокуТаблицыФормы(ФотоДляОтображения, "НомерФото", НомерФото);

	Если НайденнаяСтрока = Неопределено Тогда
		Возврат;
	КонецЕсли;

	ИмяСтраницыКартинки = НайденнаяСтрока.ИмяСтраницыКартинки;

	СтраницаКартинки = Элементы.Найти(ИмяСтраницыКартинки);

	Если СтраницаКартинки = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если Элементы.СтраницыКартинок.ТекущаяСтраница <> СтраницаКартинки Тогда
		Элементы.СтраницыКартинок.ТекущаяСтраница = СтраницаКартинки;
	КонецЕсли;

	ТекущийЭлемент = Элементы.АдресаФото;

//	Если ТекДанные.ЭтоАдресНаСайте Тогда
//		Фото = ТекДанные.АдресФото;
//	Иначе

//		НомерДетали	= ТекДанные.НомерДетали;
//		НомерФото	= ТекДанные.НомерФото;

//		ИзвлечьФотоИзХранилища(НомерДетали, НомерФото);

//	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура СтраницыКартинокПриСменеСтраницы(Элемент, ТекущаяСтраница)

	НайденнаяСтрока = НайтиСтрокуТаблицыФормы(ФотоДляОтображения, "ИмяСтраницыКартинки", ТекущаяСтраница.Имя);

	Если НайденнаяСтрока = Неопределено Тогда
		Возврат;
	КонецЕсли;

	НомерФото	= НайденнаяСтрока.НомерФото;

	УстановитьСтрокуФотоТекущей(НомерФото);

КонецПроцедуры

&НаКлиенте
Процедура УстановитьСтрокуФотоТекущей(НомерФото)

	КлючЗаписи	= ПолучитьКлючЗаписи(НомерДетали, НомерФото);

	Если Элементы.АдресаФото.ТекущаяСтрока <> КлючЗаписи Тогда
		Элементы.АдресаФото.ТекущаяСтрока = КлючЗаписи;
	КонецЕсли;

	ТекущийЭлемент = Элементы.АдресаФото;

КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьКлючЗаписи(НомерДетали, НомерФото)

	СтруктураИзмерений = Новый Структура;
	СтруктураИзмерений.Вставить("УИД",	НомерДетали);
	СтруктураИзмерений.Вставить("НомерФото",	НомерФото);

	КлючЗаписи = РегистрыСведений.ФотоДляВыгрузки.СоздатьКлючЗаписи(СтруктураИзмерений);

	Возврат КлючЗаписи;

КонецФункции

&НаСервере
Процедура ИзвлечьФотоИзХранилища(НомерДетали, НомерФото)

	МенеджерЗаписи = РегистрыСведений.ma_ФотоЗарезервированныхНомеровБУ.СоздатьМенеджерЗаписи();

	МенеджерЗаписи.НомерДетали	= НомерДетали;
	МенеджерЗаписи.НомерФото	= НомерФото;

	МенеджерЗаписи.Прочитать();

	Если НЕ МенеджерЗаписи.Выбран() Тогда
		Возврат;
	КонецЕсли;

	ХранилищеФото	= МенеджерЗаписи.ХранилищеФото;
	ДанныеФото		= ХранилищеФото.Получить();
	АдресФото		= ПоместитьВоВременноеХранилище(ДанныеФото, УникальныйИдентификатор);

	Фото = АдресФото;

КонецПроцедуры

&НаКлиенте
Функция НайтиСтрокуТаблицыФормы(КоллекцияФормы, ИмяПоля, ЗначениеПоля)

	НайденнаяСтрока = Неопределено;

	СтруктураПоиска = Новый Структура;
	СтруктураПоиска.Вставить(ИмяПоля, ЗначениеПоля);

	НайденныеСтроки = ФотоДляОтображения.НайтиСтроки(СтруктураПоиска);

	Если НайденныеСтроки.Количество() < 1 Тогда
		Возврат НайденнаяСтрока;
	КонецЕсли;

	НайденнаяСтрока = НайденныеСтроки[0];

	Возврат НайденнаяСтрока;

КонецФункции

&НаСервере
Функция НайтиСтрокуТаблицыФормыНаСервере(КоллекцияФормы, ИмяПоля, ЗначениеПоля)

	НайденнаяСтрока = Неопределено;

	СтруктураПоиска = Новый Структура;
	СтруктураПоиска.Вставить(ИмяПоля, ЗначениеПоля);

	НайденныеСтроки = ФотоДляОтображения.НайтиСтроки(СтруктураПоиска);

	Если НайденныеСтроки.Количество() < 1 Тогда
		Возврат НайденнаяСтрока;
	КонецЕсли;

	НайденнаяСтрока = НайденныеСтроки[0];

	Возврат НайденнаяСтрока;

КонецФункции

////////////////////////////////

&НаКлиенте
Процедура УдалитьФото(Команда)

	ТекДанные = Элементы.АдресаФото.ТекущиеДанные;

	Если ТекДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;

	НомерДетали	= НомерДетали;
	НомерФото	= ТекДанные.НомерФото;

	НомерФото = УдалитьФотоНаСервере(НомерДетали, НомерФото);

	ОбновитьФорму();

	УстановитьСтрокуФотоТекущей(НомерФото);

КонецПроцедуры

&НаСервере
Функция УдалитьФотоНаСервере(НомерДетали, НомерФото)

	ИндексСтроки = -1;

	МенеджерЗаписи = РегистрыСведений.ФотоДляВыгрузки.СоздатьМенеджерЗаписи();
	МенеджерЗаписи.УИД	= НомерДетали;
	МенеджерЗаписи.НомерФото	= НомерФото;
	МенеджерЗаписи.Прочитать();

	Если МенеджерЗаписи.Выбран() Тогда
		МенеджерЗаписи.Удалить();
	КонецЕсли;

	КолВоФото = ПолучитьКолВоФотоДетали(НомерДетали);

	ПоляФото = ФотоДляОтображения.Выгрузить(, "ИмяПоляКартинки, ИмяСтраницыКартинки");

	НайденнаяСтрока = НайтиСтрокуТаблицыФормыНаСервере(ФотоДляОтображения, "НомерФото", НомерФото);

	Если НайденнаяСтрока <> Неопределено Тогда

		ИндексСтроки	= ФотоДляОтображения.Индекс(НайденнаяСтрока);

		ВсегоСтрок		= ФотоДляОтображения.Количество();
		ПоследнийИндекс	= ВсегоСтрок - 1;
		ПоследняяСтрока	= ФотоДляОтображения[ПоследнийИндекс];

		ИмяСтраницыКартинки	= ПоследняяСтрока.ИмяСтраницыКартинки;

		СтраницаКартинки	= Элементы.Найти(ИмяСтраницыКартинки);

		Если СтраницаКартинки <> Неопределено Тогда
			СтраницаКартинки.Видимость = Ложь;
		КонецЕсли;

		ФотоДляОтображения.Удалить(НайденнаяСтрока);

	КонецЕсли;

	ВсегоСтрок		= ФотоДляОтображения.Количество();
	ПоследнийИндекс	= ПоследнийИндекс - 1;

	Для ИДХ = 0 По ПоследнийИндекс Цикл

		Порядок		= ИДХ + 1;

		ПредСтрока	= ПоляФото[ИДХ];
		ТекСтрока	= ФотоДляОтображения[ИДХ];
		ТекНомер	= ТекСтрока.НомерФото;

		ТекСтрока.НомерФото				= Порядок;
		ТекСтрока.ИмяПоляКартинки		= ПредСтрока.ИмяПоляКартинки;
		ТекСтрока.ИмяСтраницыКартинки	= ПредСтрока.ИмяСтраницыКартинки;

		МенеджерЗаписи = РегистрыСведений.ФотоДляВыгрузки.СоздатьМенеджерЗаписи();
		МенеджерЗаписи.УИД	= НомерДетали;
		МенеджерЗаписи.НомерФото	= ТекНомер;
		МенеджерЗаписи.Прочитать();

		Если МенеджерЗаписи.Выбран() Тогда
			МенеджерЗаписи.НомерФото	= Порядок;
		КонецЕсли;

		МенеджерЗаписи.Записать(Истина);

	КонецЦикла;

	НомерФото = 0;

	ИндексСтроки = ?(
		  (ИндексСтроки < ВсегоСтрок) И (ИндексСтроки >= 0)
		, ИндексСтроки
		, ПоследнийИндекс
	);

	Если ИндексСтроки > 0 Тогда
		НомерФото = ФотоДляОтображения[ИндексСтроки].НомерФото;
	КонецЕсли;

	Возврат НомерФото;

КонецФункции

////////////////////////////////

&НаКлиенте
Процедура ОтправитьФото(Команда)

	Если ФотоДляОтображения.Количество() < 1 Тогда
		Сообщить("Немає фото для відправки.");
		Возврат;
	КонецЕсли;

	

		СтатусОшибки = ОтправитьФотографии(НомерДетали);

		Если НЕ СтатусОшибки Тогда
			Закрыть();
		КонецЕсли;

	

КонецПроцедуры

&НаКлиенте
Процедура ОтправитьФотоКомплекта(ОтветПользователя, ПодчиненныеНомера) Экспорт

	Если ОтветПользователя <> КодВозвратаДиалога.Да Тогда
		Возврат;
	КонецЕсли;

	СтатусОшибки = Ложь;

	Для Каждого СтрокаНомера Из ПодчиненныеНомера Цикл
		СтатусОшибки = ОтправитьФотографии(СтрокаНомера.НомерДетали) ИЛИ СтатусОшибки;
	КонецЦикла;

	Если НЕ СтатусОшибки Тогда
		СтатусОшибки = ОтправитьФотографии(НомерДетали);
	КонецЕсли;

	Если НЕ СтатусОшибки Тогда
		Закрыть();
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Функция ОтправитьФотографии(НомерДеталиЧислом) Экспорт

	ОтветСервера = ОтправитьФотоНаСервер(НомерДеталиЧислом);

	СтатусОшибки = (НЕ ЗначениеЗаполнено(ОтветСервера));

	//НомерДеталиСтрокой = Формат(НомерДеталиЧислом, "ЧРГ=' '");

	Если СтатусОшибки Тогда

		ТекстСообщения =  "Помилка, фотографії деталі " + Наименование + " не були відправлені. "
			+ "Перевірте наявність фотографій і з'єднання.";

		ПоказатьПредупреждение(, ТекстСообщения, , "Отправка не удалась");

	Иначе

		ТекстСообщения = "Передача фотографій деталі " + Наименование + " завершена успішно.";

	КонецЕсли;

	Возврат СтатусОшибки;

КонецФункции

&НаСервереБезКонтекста
Функция ПолучитьПодчиненныеНомераДеталей(НомерКомплектаЧислом)
	Возврат Обработки.ФотографированиеЗапчастей.ПолучитьПодчиненныеНомераДеталей(НомерКомплектаЧислом);
КонецФункции

Функция ОтправитьФотоНаСервер(НомерДеталиЧислом) Экспорт

	

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ФотоДляВыгрузки.НомерФото КАК ИмяФайла,
		|	ФотоДляВыгрузки.ДатаСоздания,
		|	ФотоДляВыгрузки.Фото
		|ИЗ
		|	РегистрСведений.ФотоДляВыгрузки
		|КАК
		|	ФотоДляВыгрузки
		|
		|ГДЕ  ФотоДляВыгрузки.УИД = &НомерДетали
		|";

	Запрос.УстановитьПараметр("НомерДетали",	НомерДеталиЧислом);

	РезультатЗапроса	= Запрос.Выполнить();

	ТаблицаРезультата	= РезультатЗапроса.Выгрузить();

	ХранилищеТаблицы	= Новый ХранилищеЗначения(ТаблицаРезультата);
	Прокси = ПроцедурыОбменаДанными.ПолучитьПрокси();

	Если Прокси = Неопределено Тогда
		Возврат -1;
	КонецЕсли;
	
	Док = Документы.vrgТребованияНакладнаяМобыльный.ПолучитьСсылку(Новый УникальныйИдентификатор(НомерДеталиЧислом));
	Номер = Док.Номер;
	ОтветСервера = Прокси.ЗагрузитьФото(Номер, ХранилищеТаблицы);

		Если ЗначениеЗаполнено(ОтветСервера) Тогда
			Для Каждого СтрокаФото Из ТаблицаРезультата Цикл
				МенеджерЗаписи = РегистрыСведений.ФотоДляВыгрузки.СоздатьМенеджерЗаписи();
				МенеджерЗаписи.УИД	= НомерДетали;
				МенеджерЗаписи.НомерФото	= СтрокаФото.ИмяФайла;
				МенеджерЗаписи.Прочитать();
			
			Если МенеджерЗаписи.Выбран() Тогда
				МенеджерЗаписи.Удалить();
			КонецЕсли;
			КонецЦикла;

		КонецЕсли;

	
	Возврат ОтветСервера;

КонецФункции

// - 48503 ДДГ
